#######if 语句可以互相嵌套

""" 
if 条件一：
    if 条件二（条件一的情况下）
        代码1.......

    else:
        条件二的对立面，条件一下



"""


######根据用户的钱输入事情#######
money = int(input("请输入你所拥有的钱："))

if money > 500:
    if money > 1000:
        print("走去买耐克")
    else:
        print("随便买个潮流小众的吧")
else:
    print("还看啥，回家吧！")

#首先要先符合大于500，不大于，那么直接回家，符合了才可以进入条件嵌套里面
# 大于500但是没有大于1000，那么就去买潮流小众的牌子，大于500进入条件嵌套里面开始第二次判断




#==============================if...else可以无限嵌套===========================================
neili = int(input("大侠,江湖险恶,请告诉我你的内力修为年数吧\n"))

if neili >5 :
    if neili > 10 :
        if neili > 15:
            if neili >20:
                if neili > 25:
                    if neili >30:
                        if neili>40:
                            if neili >60:
                                print("大侠武功高强,老夫已经没有什么可以教你的了,大侠下山后切记要保护黎明百姓啊！！！")
                            else:
                                print("大侠此等实力,可谓一代宗师啊！！！")
                        else:
                            print("大侠这数十年内力精修,算得上为一代大师！！！")
                    else:
                        print("大侠,有此等修为,可谓是武林中敌手鲜有啊！！！")
                else:
                    print("大侠有这般实力,可以开宗立派,广收学徒亦！！！")
            else:
                print("少侠,此等年纪,有这般实力,相比少侠忍常人不能忍,老夫佩服！！！")
        else:
            print("少侠勤奋好学,日后江湖中的惩恶扬善之事,还得从少侠做起啊！！！")
    else:
        print("少侠,老夫看你骨骼清奇,可愿意拜于老夫门下？？？")
else:
    print("少侠,老夫观你骨骼清奇,是块练武的好料子,老夫就收你做关门弟子可好啊？？？")