#======================第四种情况===========================
"""
    if 条件 1:
        代码 1
    elif 条件 2:
        代码 2
    elif 条件 3:
        代码3
    ......

    else:
        XXXX


    如果条件1成立,执行代码1,否则(条件1不成立)如果条件2成立,执行代码2
    否则(条件2不成立时)如果条件3成立,执行代码3
    如果以上都不成立,执行else下的代码

"""

###=================第四种===================####
money = int(input("请输入你的余额:"))

if money >= 5000:
    print("小康生活就是你吗?买两件耐克牌潮流衣服,然后再吃个饭")
elif money >= 3000:
    print("厉害了,能买件衣服还能吃个饭咯！！！")
elif money >= 1000:
    print("那敢情好,买件耐克的衣服:")
elif money >= 500:
    print("走,能去买一件衣服吧！！！")
else:
    print("还是想想吧!回家吃饭吧")
